app/controllers/api/v1/meals_controller.rb

    def index
        #if logged_in?
            @meals = Meal.all
---
SELECT "meals".* FROM "meals"