app/controllers/api/v1/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
    def index
        #if logged_in?
            @workouts = Workout.all